Repository: barjac/remove-old-kernels
Catalog: po/*.UTF-8.po
Languages: nb_no, pt_br, ru_ru

source: LIVE System
ru_ru: Система LIVE

source: System
ru_ru: Система

source: Usage: <remove-old kernels|rok> [-a] [-A 0|1] [-c] [-t] [-f 0-9] [-F 0-9] [-n number] [-N number] [-p] [-q] [-Q 0|1][-l] [-m] [-v] [-h|-?]
nb_no: Bruk: <remove-old kernels|rok> [-a] [-A 0|1] [-c] [-t] [-f 0-9] [-F 0-9] [-n nummer] [-N nummer] [-p] [-q] [-Q 0|1][-l] [-m] [-v] [-h|-?]
pt_br: Uso: <remove-old kernels|rok> [-a] [-A 0|1] [-c] [-t] [-f 0-9] [-F 0-9] [-n número] [-N número] [-p] [-q] [-Q 0|1][-l] [-m] [-v] [-h|-?]
ru_ru: Применение: <remove-old kernels|rok> [-a] [-A 0|1] [-c] [-t] [-f 0-9] [-F 0-9] [-n и число] [-N и число] [-p] [-q] [-Q 0|1][-l] [-m] [-v] [-h|-?]

source: -a = automatic, no questions. Interactive if not specified. (must be root)
nb_no: -a = automatisk, ingen spørsmål. Interaktiv hvis ikke spesifisert. (må være root)
pt_br: -a = automático, sem perguntas. Interativo se não especificado. (deve ser root)
ru_ru: -a = автоматический режим, запустить сейчас, только один раз. (требуются права root)

source: -A value = 1 or 0 to turn ON or OFF automatic weekly removal of kernels. (e.g. -A1)
nb_no: -A verdi = 1 eller 0 for å slå PÅ eller AV automatisk ukentlig fjerning av kjerner. (f.eks. -A1)
pt_br: -A valor = 1 ou 0 para ligar (ON) ou desligar (OFF) a remoção semanal automática de kernels. (ex. -A1)
ru_ru: -A и число = 1 чтобы ВКЛ или 0 чтобы ВЫКЛ автоматическое еженедельное удаление ядер. (например, -A1)

source: -c = as automatic but also checks for CRON=1 in the cfg file or exits. (must be root)
nb_no: -c = som automatisk, men sjekker også for CRON=1 i cfg-filen eller avslutter. (må være root)
pt_br: -c = como automático mas checando também por CRON=1 no arquivo de config ou finaliza. (deve ser root)
ru_ru: -c = как автоматический, но с проверкой параметра CRON=1 в файле .cfg или завершает работу. (требуются права root)

source: -t = Test mode, nothing is removed, urpme is simulated. Note: As root config may be updated
nb_no: -t = Testmodus. Ingenting fjernes, urpme simuleres. Merk: Som root kan konfigurasjon oppdateres
ru_ru: -t = режим тестирования, ничего не удаляется, имитируется работа urpme. Примечание: при запуске от root, совместно с другими опциями, конфигурация может быть изменена.

source: -f value = number of the alternate .cfg file to use this time only. Exits if missing.
nb_no: -f value = verdi = nummeret på den alternative .cfg-filen som bare skal brukes denne gangen. Avslutter ut hvis det mangler.
pt_br: -f valor = número do arquivo .cfg alterativo para usar apenas dessa vez. Finaliza se não encontrado.
ru_ru: -f и число = номеру альтернативного файла .cfg, который будет использован только в этот раз. Завершает работу, если файла не существует.

source: -F value = number of alt .cfg file to use. This changes the ALTCFG= setting in the main .cfg file.
nb_no: -F verdi = nummeret på den alternative .cfg-filen som skal brukes. Dette endrer ALTCFG=-innstillingen i hoved-.cfg-filen.
pt_br: -F valor = número do arquivo .cfg alternativo para usar. Isto altera a configuração ALTCFG= no arquivo .cfg principal.
ru_ru: -F и число = номеру альтернативного файла .cfg. Изменяет значение ALTCFG= в основном файле .cfg.

source: -n value = number of kernels to keep this time only. (-n5 or -n 5 keep 5 kernels), Min=2, Default=3
nb_no: -n verdi = antall kjerner som skal beholdes denne ene gangen. (-n5 eller -n 5 beholder 5 kjerner), Minimum=2, Standard=3
pt_br: -n valor = número de kernels a serem mantidos apenas esta vez. (-n5 ou -n 5 mantém 5 kernels), Min=2, Padrão=3
ru_ru: -n и число = количеству ядер, которые нужно сохранить только в этот раз. (-n5 или -n 5 сохраняет 5 ядер), min=2, по умолчанию=3

source: -N value = number of kernels to keep. This changes the config file setting. (e.g. -N 5)
nb_no: -N verdi = antall kjerner som skal beholdes. Dette endrer konfigurasjonsfilinnstillingen. (f.eks. -N 5)
pt_br: -N valor = número de kernels a serem mantidos. Isto altera o arquivo de configuração. (ex. -N 5)
ru_ru: -N и число = количеству ядер, которые следует сохранить. Изменяет настройки конфигурационного файла. (например, -N 5)

source: -p = preview the urpme commands which would be used.
nb_no: -p = forhåndsvis urpme-kommandoene som vil bli brukt.
pt_br: -p = visualize os comandos urpme que seriam usados.
ru_ru: -p = предварительный просмотр команд которые будет использовать urpme.

source: -q = advanced mode, this time only - see man page.
nb_no: -q = avansert modus, kun denne gangen - se man-siden.
pt_br: -q = modo avançado, apenas esta vez - veja o manual.
ru_ru: -q = расширенный режим, подробнее см. страницу man.

source: -Q value = 1 or 0 (1 = ON) advanced mode, persistent. (e.g. -Q1)
nb_no: -Q verdi = 1 eller 0 (1 = PÅ) avansert modus, vedvarende. (f.eks. -Q1)
pt_br: -Q valor = 1 ou 0 (1 = Ligado) modo avançado, persistente. (ex. -Q1)
ru_ru: -Q и число = 1 или 0 (1 = ВКЛ) расширенный режим, на постоянно. (например, -Q1)

source: -l = list the last 1000 lines of the log.
nb_no: -l = liste opp de siste 1000 linjene i loggen.
pt_br: -l = lista as últimas 1000 linhas do log.
ru_ru: -l = показать последние 1000 строк log-журнала.

source: -m = mono. No colours in screen output.
nb_no: -m = mono. Ingen farger på skjermutskriften.
pt_br: -m = monocromático. Sem cores na saída padrão.
ru_ru: -m = чёрно-белый режим. Не использовать цвета при выводе на экран монитора.

source: -v = version.
nb_no: -v = versjon.
pt_br: -v = versão.
ru_ru: -v = показать версию программы.

source: -? or -h = show this help.
nb_no: -? eller -h = Vis denne hjelpemeldingen.
pt_br: -? ou -h = mostra essa ajuda.
ru_ru: -? или -h = показать справку.

source: KEY for column 3:
nb_no: NØKKEL for kolonne 3:
pt_br: TECLA para coluna 3:
ru_ru: КЛЮЧ для столбца 3:

source: U = currently (U)sed running kernel.
nb_no: U = kjernen som kjører for øyeblikket.
pt_br: U = Kernel em execução (U)sado atualmente.
ru_ru: U = текущее (U) используемое ядро.

source: L = (L)IVE system original kernel - protected.
nb_no: L = (L)IVE-systemets originale kjerne - beskyttet.
ru_ru: L = исходное ядро системы (L)IVE - защищено.

source: V = keeping for (V)irtualbox. (only in advanced mode)
nb_no: V = behold for (V)irtualbox. (bare i avansert modus)
ru_ru: V = сохранить для (V)irtualbox. (только в расширенном режиме)

source: X = keeping for (X)tables-addons (only in advanced mode)
nb_no: X = behold for (X)tables-addons (bare i avansert modus)
ru_ru: X = сохранить для (X)tables-addons (только в расширенном режиме)

source: K = keeping for installed (K)ernel. (only advanced mode)
nb_no: K = behold for installert (K)jerne. (bare i avansert modus)
ru_ru: K = сохранить для установленного (K) ядра. (только в расширенном режиме)

source: Standard Message explanations:
ru_ru: Пояснения стандартных сообщений:

source: — Diagnostic information useful for developers.
ru_ru: — Диагностическая информация, полезная для разработчиков.

source: — Information only. No action required.
ru_ru: — Только информация. Никаких действий не требуется.

source: — Warning of an unexpected or suspicious event.
ru_ru: — Предупреждение о неожиданном или подозрительном событии.

source: — An error occurred, program stopped.
ru_ru: — Произошла ошибка, программа остановлена.

source: — A critical error occurred. Program stopped.
ru_ru: — Произошла критическая ошибка. Программа остановлена.

source: Must be root to edit configuration
nb_no: Du må være root for å redigere konfigurasjonen
pt_br: Deve ser root para editar a configuração
ru_ru: Для редактирования настроек конфигурации требуются права root

source: Tap spacebar
nb_no: Trykk på mellomromstasten
pt_br: Aperte espaço
ru_ru: Нажмите пробел

source: No such alternative configuration file:
nb_no: Ingen slik alternativ konfigurasjonsfil:
pt_br: Não existe arquivo de configuração alternativo:
ru_ru: Нет такого альтернативного файла конфигурации:

source: Failed to read:
nb_no: Kunne ikke lese:
ru_ru: Не удалось прочитать:

source: Your alternative configuration file does not exist:
nb_no: Den alternative konfigurasjonsfilen din finnes ikke:
pt_br: Seu arquivo de configuração alternativo não existe:
ru_ru: Вашего альтернативного файла конфигурации не существует:

source: Either replace it or set ALTCFG=0 in
nb_no: Enten bytt den ut eller sett inn ALTCFG=0
pt_br: Substitua-o ou configure ALTCFG=0 em
ru_ru: Либо замените его, либо установите ALTCFG=0

source: Please use 0 or 1 for OFF and ON
nb_no: Bruk 0 eller 1 for AV og PÅ
ru_ru: Пожалуйста, используйте 0 для Выключения или 1 для Включения

source: Bad input value
nb_no: Ugyldig inngangsverdi
ru_ru: Введённое значение некорректно

source: In a LIVE system N is fixed.
ru_ru: В системе LIVE N является фиксированным.

source: Tap spacebar to exit
nb_no: Trykk på mellomromstasten for å avslutte
ru_ru: Нажмите пробел, чтобы выйти

source: Welcome to 'remove-old-kernels' Interactive
nb_no: Velkommen til «remove-old-kernels»-Interaktiv
pt_br: Bem-vindo ao 'remove-old-kernels' Interativo
ru_ru: Добро пожаловать в интерактивный режим 'remove-old-kernels'

source: Number to keep is restricted to
nb_no: Antallet som skal beholdes er begrenset til
ru_ru: Количество сохраняемых ядер ограничено до

source: , by the dnf 'installonly_limit' set in /etc/dnf/dnf.conf
nb_no: , av dnf-innstillingen «installonly_limit» i /etc/dnf/dnf.conf
pt_br: , pelo dnf 'installonly_limit' definido em /etc/dnf/dnf.conf
ru_ru: , параметр dnf 'installonly_limit', установлен в /etc/dnf/dnf.conf

source: Has the running kernel been uninstalled since last boot? - Aborting.
nb_no: Har kjernen som kjører blitt avinstallert siden siste oppstart? - Avbryter.
ru_ru: Возможно с момента последней загрузки запущенное ядро было уже удалено. - Выполнение прервано.

source: Keep
nb_no: Behold
pt_br: Manter
ru_ru: Сохранить

source: Remove
nb_no: Fjern
pt_br: Remover
ru_ru: Удалить

source: Kernels in
nb_no: Kjerner i
pt_br: Kernels em
ru_ru: Ядра в

source: KEEP
nb_no: BEHOLD
pt_br: MANTER
ru_ru: СОХРАНИТЬ

source: In use now
nb_no: Brukes nå
pt_br: Em uso agora
ru_ru: Используется сейчас

source: LIVE system original kernel
nb_no: LIVE-systemets originale kjerne
ru_ru: Исходное ядро системы LIVE

source: Commands that would be used
nb_no: Kommandoer som vil bli brukt
ru_ru: Команды которые будут использоваться

source: Command that would be used
nb_no: Kommando som vil bli brukt
ru_ru: Команда которая будет использоваться

source: Must be root to allow removal
nb_no: Du må være root for å kunne fjerne
pt_br: Deve ser root para permitir a remoção
ru_ru: Для удаления ядер требуются права root

source: Test mode is on - kernels will not be removed
nb_no: Testmodus er på - kjerner blir ikke fjernet
pt_br: Modo de teste ativado - kernels não serão removidos
ru_ru: Включен режим тестирования - ядра удаляться не будут

source: kernels
nb_no: kjerner
ru_ru: ядра

source: kernel
nb_no: kjerne
ru_ru: ядро

source: y/N/i (i=confirm for each)
nb_no: y/N/i (i=bekreft for hver enkelt)
pt_br: y/N/i (y=ja N=não i=confirmar cada um)
ru_ru: y/N/i (y=да/ N=нет/ i=подтверждать каждый пункт)

source: interactive
nb_no: interaktiv
pt_br: interativo
ru_ru: интерактивный

source: Aborted
nb_no: Avbrutt
pt_br: Abortado
ru_ru: Прервано

source: y/N/q (q=quit)
nb_no: y/N/q (q=avslutt)
pt_br: y/N/q (y=ja N=não q=sair)
ru_ru: y/N/q (q=выйти)

source: Could execute: urpme
nb_no: Kan kjøre: urpme
ru_ru: Может быть выполнено: urpme

source: Gain
nb_no: Styrke
pt_br: Ganho
ru_ru: Освободится

source: -t = Test mode, nothing is removed, urpme is simulated.
pt_br: -t = Modo de teste, nada é removido, urpme é simulado.

source: V = keeping for (V)irtualbox -latest. (only in advanced mode)
pt_br: V = mantendo para (V)irtualbox -latest. (apenas no modo avançado)

source: X = keeping for (X)tables-addons -latest. (only in advanced mode)
pt_br: X = mantendo para (X)tables-addons -latest. (apenas no modo avançado)

source: K = keeping kernel-*-devel for installed (K)ernel. (only advanced mode)
pt_br: K = mantendo kernel-*-devel para o (K)ernel instalado. (apenas modo avançado)

source: FATAL: Failed to read:
pt_br: FATAL: Falha de leitura:

source: INFO: Number to keep is restricted to
pt_br: INFORMAÇÃO: O número a manter está limitado a

source: FATAL: Has the running kernel been uninstalled since last boot? - Aborting.
pt_br: FATAL: O kernel em execução foi desinstalado desde a última inicialização? - Abortando.

source: DEBUG: Could execute: urpme
pt_br: DEBUG: Poderia executar: urpme
